tap "avencera/tap"
tap "bloodmagesoftware/tap"
tap "goreleaser/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "libsql/sqld"
tap "tsukinoko-kun/tap"
tap "tursodatabase/tap"
# Run your GitHub Actions locally
brew "act"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Object-file caching compiler wrapper
brew "ccache"
# C/C++/ObjC language server
brew "ccls"
# Development kit for the Java programming language
brew "openjdk"
# Check Java source against a coding standard
brew "checkstyle"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Static analysis of C and C++ code
brew "cppcheck"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# .NET Core
brew "dotnet"
# Platform built on V8 to build network applications
brew "node"
# Speed up eslint to accelerate your development workflow
brew "eslint_d"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# Git extension for versioning large files
brew "git-lfs"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Golang formatter that fixes long lines
brew "golines"
# Reformats Java source code to comply with Google Java Style
brew "google-java-format"
# Language server for the Go language
brew "gopls"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Tool for glamorous shell scripts
brew "gum"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Git-compatible distributed version control system
brew "jj"
# Lightweight and flexible command-line JSON processor
brew "jq"
# JSON parser and validator with a CLI
brew "jsonlint"
# Handy way to save and run project-specific commands
brew "just"
# Simple terminal UI for git commands
brew "lazygit"
# Tool for linting and static analysis of Lua code
brew "luacheck"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Fast, highly customisable system info script
brew "neofetch"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Draw UML diagrams
brew "plantuml"
# Fast, disk space efficient package manager
brew "pnpm"
# Prettier daemon
brew "prettierd"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Static type checker for Python
brew "pyright"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Generate type safe Go from SQL
brew "sqlc"
# Non-interactive SSH password auth
brew "sshpass"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Modern CSS linter
brew "stylelint"
# Opinionated Lua code formatter
brew "stylua"
# Language for writing HTML user interfaces in Go
brew "templ"
# Markup-based typesetting system
brew "typst"
# Beautiful and reliable typst code formatter
brew "typstyle"
# C++ Library Manager
brew "vcpkg"
# Simple terminal image viewer written in Rust
brew "viu"
# Internet file retriever
brew "wget"
# Bring your favorite shell wherever you go through the ssh
brew "xxh"
# Linter for YAML files
brew "yamllint"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Additional completion definitions for zsh
brew "zsh-completions"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Better and friendly vi(vim) mode plugin for ZSH
brew "zsh-vi-mode"
# CLI for organizing Tailwind CSS classes
brew "avencera/tap/rustywind"
# A Docker Compose templating plugin
brew "bloodmagesoftware/tap/docker-craft"
# Generate C/C++ header files from source files
brew "bloodmagesoftware/tap/makeheaders"
# Release engineering, simplified
brew "goreleaser/tap/goreleaser"
# ls replacement
brew "tsukinoko-kun/tap/list"
# Simple local file sharing
brew "tsukinoko-kun/tap/portal"
# Simple file server with a little extra
brew "tsukinoko-kun/tap/serve"
brew "tursodatabase/tap/turso"
# Command-line interface for 1Password
cask "1password-cli"
# Professional graphic design software
cask "affinity-designer"
# Professional image editing software
cask "affinity-photo"
# Multi-track audio editor and recorder
cask "audacity"
# Display management tool
cask "betterdisplay"
cask "font-jetbrains-mono"
cask "font-tex-gyre-cursor"
cask "font-tex-gyre-termes"
cask "font-tex-gyre-termes-math"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Custom Discord client
cask "legcord"
# Replacement for Docker Desktop
cask "orbstack"
# Control your tools with a few keystrokes
cask "raycast"
# PDF reader and note-taking application
cask "skim"
# SSH client
cask "termius"
# Multimedia player
cask "vlc"
