tap "avencera/tap"
tap "bloodmagesoftware/tap"
tap "charmbracelet/tap"
tap "go-task/tap"
tap "goreleaser/tap"
tap "hashicorp/tap"
tap "krishkrosh/apps"
tap "libsql/sqld"
tap "oven-sh/bun"
tap "pogo-vcs/tap"
tap "sst/tap"
tap "tsukinoko-kun/tap"
tap "tursodatabase/tap"
# Portable ASCII art graphics library
brew "aalib"
# Run your GitHub Actions locally
brew "act"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# NaCl networking and cryptography library
brew "libsodium"
# Library for command-line editing
brew "readline"
# General-purpose data compression with high compression ratio
brew "xz"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Extremely fast non-cryptographic hash algorithm
brew "xxhash"
# Object-file caching compiler wrapper
brew "ccache"
# Next-gen compiler infrastructure
brew "llvm"
# C/C++/ObjC language server
brew "ccls"
# Development kit for the Java programming language
brew "openjdk"
# Check Java source against a coding standard
brew "checkstyle"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Static analysis of C and C++ code
brew "cppcheck"
# HTTP/3 library written in C
brew "libnghttp3"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# .NET Core
brew "dotnet"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Speed up eslint to accelerate your development workflow
brew "eslint_d"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Firebase command-line tools
brew "firebase-cli"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Tcl/Tk UI for the git revision control system
brew "git-gui"
# Git extension for versioning large files
brew "git-lfs"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Stricter gofmt
brew "gofumpt"
# Fast linters runner for Go
brew "golangci-lint"
# Golang formatter that fixes long lines
brew "golines"
# Reformats Java source code to comply with Google Java Style
brew "google-java-format"
# Language server for the Go language
brew "gopls"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Development framework for multimedia applications
brew "gstreamer"
# Tool for glamorous shell scripts
brew "gum"
# Command-line benchmarking tool
brew "hyperfine"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Git-compatible distributed version control system
brew "jj"
# Lightweight and flexible command-line JSON processor
brew "jq"
# JSON parser and validator with a CLI
brew "jsonlint"
# Handy way to save and run project-specific commands
brew "just"
# Simple terminal UI for git commands
brew "lazygit"
# LLM inference in C/C++
brew "llama.cpp"
# LLVM Project Linker
brew "lld"
# Tool for linting and static analysis of Lua code
brew "luacheck"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Unified display of technical and tag data for audio/video
brew "media-info"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Fast, highly customisable system info script
brew "neofetch"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# Small build system for use with gyp or CMake
brew "ninja"
# Blingful character graphics/TUI library
brew "notcurses"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Draw UML diagrams
brew "plantuml"
# Fast, disk space efficient package manager
brew "pnpm"
# Prettier daemon
brew "prettierd"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Static type checker for Python
brew "pyright"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Generate type safe Go from SQL
brew "sqlc"
# Non-interactive SSH password auth
brew "sshpass"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Modern CSS linter
brew "stylelint"
# Opinionated Lua code formatter
brew "stylua"
# Modernized, complete, self-contained TeX/LaTeX engine
brew "tectonic"
# Language for writing HTML user interfaces in Go
brew "templ"
# Command-line tool for sharing terminal over the web
brew "ttyd"
# Markup-based typesetting system
brew "typst"
# Beautiful and reliable typst code formatter
brew "typstyle"
# C++ Library Manager
brew "vcpkg"
# Simple terminal image viewer written in Rust
brew "viu"
# V programming language
brew "vlang"
# Internet file retriever
brew "wget"
# Utilities to create and convert Web Open Font File (WOFF) files
brew "woff2"
# Bring your favorite shell wherever you go through the ssh
brew "xxh"
# Linter for YAML files
brew "yamllint"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Additional completion definitions for zsh
brew "zsh-completions"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Better and friendly vi(vim) mode plugin for ZSH
brew "zsh-vi-mode"
# CLI for organizing Tailwind CSS classes
brew "avencera/tap/rustywind"
# A Docker Compose templating plugin
brew "bloodmagesoftware/tap/docker-craft"
# Generate C/C++ header files from source files
brew "bloodmagesoftware/tap/makeheaders"
# A powerful terminal-based AI assistant for developers, providing intelligent coding assistance directly in your terminal.
brew "charmbracelet/tap/crush"
# Task runner / simpler Make alternative written in Go
brew "go-task/tap/go-task"
# Release engineering, simplified
brew "goreleaser/tap/goreleaser"
# Vault
brew "hashicorp/tap/vault"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# The AI coding agent built for the terminal.
brew "sst/tap/opencode"
# ls replacement
brew "tsukinoko-kun/tap/list"
# Simple local file sharing
brew "tsukinoko-kun/tap/portal"
# Simple file server with a little extra
brew "tsukinoko-kun/tap/serve"
brew "tursodatabase/tap/turso"
# Command-line interface for 1Password
cask "1password-cli"
# Professional graphic design software
cask "affinity-designer"
# Professional image editing software
cask "affinity-photo"
# Multi-track audio editor and recorder
cask "audacity"
# Display management tool
cask "betterdisplay"
# Database version management tool
cask "dbngin"
cask "font-jetbrains-mono"
cask "font-tex-gyre-cursor"
cask "font-tex-gyre-termes"
cask "font-tex-gyre-termes-math"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Utility to hide menu bar items
cask "hiddenbar"
# Free and open-source media player
cask "iina"
# Custom Discord client
cask "legcord"
# Utility to display the lid angle and play a creaking sound
cask "lidanglesensor"
# Replacement for Docker Desktop
cask "orbstack"
# Control your tools with a few keystrokes
cask "raycast"
# PDF reader and note-taking application
cask "skim"
# Native GUI tool for relational databases
cask "tableplus"
# SSH client
cask "termius"
# Turn your MacBook's trackpad into a precise digital weighing scale
cask "trackweight"
# Multimedia player
cask "vlc"
go "github.com/air-verse/air"
go "github.com/tsukinoko-kun/bauplan"
go "github.com/tsukinoko-kun/ckuna"
go "github.com/bloodmagesoftware/climage"
go "github.com/spf13/cobra-cli"
go "gqlc"
go "github.com/tsukinoko-kun/netest"
go "github.com/pogo-vcs/pogo"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/a-h/templ/cmd/templ"
go "github.com/tsukinoko-kun/timy"
go "github.com/tsukinoko-kun/tout"
go "white"
go "github.com/pogo-vcs/windows-service"
